{"events": [{"date": "2019-08-21T11:00:00+02:00", "start": "11:00", "duration": "00:30", "room": "Curie", "title": "Opening Ceremony", "language": "en", "abstract": "A hearty welcome me lasses and lads!", "timestamp": 619693200, "day": "1"}, {"date": "2019-08-21T12:00:00+02:00", "start": "12:00", "duration": "00:45", "room": "Curie", "title": "card10 Badge", "language": "en", "abstract": "Introducing you to card10, the 2019 camp badge, bio monitor, wrist worn POV device, and everything else your imagination comes up with.", "timestamp": 619696800, "day": "1"}, {"date": "2019-08-21T12:00:00+02:00", "start": "12:00", "duration": "00:45", "room": "Meitner", "title": "Knoten 101", "language": "de", "abstract": "Die CCC-family geht campen, das heisst der Knoten wird ausnahmsweise vom abstrakten mathematischen Konzept zur ganz realen Anwendung von Seil und Schnur. Was da alles schiefgehen kann, wo Knoten herkommen und wer sie verwendet wird hier kurz und knackig bearbeitet.", "timestamp": 619696800, "day": "1"}, {"date": "2019-08-21T13:00:00+02:00", "start": "13:00", "duration": "00:45", "room": "Curie", "title": "Hacking Containers and Kubernetes ", "language": "en", "abstract": "The talks shows the security model of Kubernetes and how to detect and fight security weaknesses with a few lines of scripting.", "timestamp": 619700400, "day": "1"}, {"date": "2019-08-21T13:00:00+02:00", "start": "13:00", "duration": "00:45", "room": "Meitner", "title": "The Great British Drone Panic", "language": "en", "abstract": "Looking at the sorry saga of drone incident reports and drone-related airport closures in the UK, and shining a light on the woefully poor quality of official investigations, police response, and media reporting.", "timestamp": 619700400, "day": "1"}, {"date": "2019-08-21T16:00:00+02:00", "start": "16:00", "duration": "00:45", "room": "Curie", "title": "Reporting from Brussels: The state of Digital Rights", "language": "en", "abstract": "Come and find out how digital rights will be impacted by the new European Parliament, European Commission and Brexit. In the process, get updates about the burning topics we are following in the EU institutions. ", "timestamp": 619711200, "day": "1"}, {"date": "2019-08-21T16:00:00+02:00", "start": "16:00", "duration": "00:45", "room": "Meitner", "title": "Make Your Tech and Wear It Too", "language": "en", "abstract": "In this talk i’d like to give an introduction to the materials, tools, skills and energies involved in making electronic textiles and tailoring wearable technology, which has been my practice for the past 13 years.", "timestamp": 619711200, "day": "1"}, {"date": "2019-08-21T17:00:00+02:00", "start": "17:00", "duration": "00:45", "room": "Curie", "title": "Fomu - an FPGA inside your USB port!", "language": "en", "abstract": "", "timestamp": 619714800, "day": "1"}, {"date": "2019-08-21T17:00:00+02:00", "start": "17:00", "duration": "00:45", "room": "Meitner", "title": "DoH or Don't", "language": "en", "abstract": "Seldom have DNS protocol changes sparked such fierce debate as happen in the case of DNS-over-HTTPs (Doh) and it's little cousin, DNS-over-TLS (DoT). While for many people it is a matter of black and white, the reality out there is various shades of grey ;)\r\n\r\nThis talk will discuss the technical and political aspects of these DNS privacy protocols, where they come from, who is implementing DoH/DoT (both in the browser space and otherwise) and why it is a [good|bad] idea to support these protocol implementations.", "timestamp": 619714800, "day": "1"}, {"date": "2019-08-21T18:00:00+02:00", "start": "18:00", "duration": "00:45", "room": "Curie", "title": "spispy: SPI flash device emulation", "language": "en", "abstract": "<a href=\"https://github.com/osresearch/spispy\">spispy</a> is an open source hardware tool for emulating SPI flash chips that makes firmware development and boot security research easier. In this talk we'll discuss the challenges of interfacing on the SPI bus and emulating SPI devices, as well as demonstrate how to use it quickly debug issues with coreboot and how we used spispy to discover a critical class of TOCTOU vulnerabilities in secure boot systems like Intel BootGuard.", "timestamp": 619718400, "day": "1"}, {"date": "2019-08-21T18:00:00+02:00", "start": "18:00", "duration": "00:45", "room": "Meitner", "title": "Introduction to (home) network security.", "language": "en", "abstract": "Typical home networks use a closed-source Internet Service Provider supplied router/firewall and contain no restrictions on communications between clients within the network. The widespread deployment of network-connected appliances, control systems, lighting, etc, means that this design is insecure. This talk will cover the basics of networking, including why and how segregation of different types of network clients and traffic can be achieved to increase privacy and security.", "timestamp": 619718400, "day": "1"}, {"date": "2019-08-21T20:00:00+02:00", "start": "20:00", "duration": "00:45", "room": "Curie", "title": "Aufstand oder Aussterben? Ein Vortrag über die Klimakrise, ökologischen Kollaps und zivilen Ungehorsam.", "language": "de", "abstract": "EXTINCTION REBELLION (XR) ist eine schnell wachsende globale Graswurzel-Bewegung von Klima-Aktivist*innen, die mit gewaltfreien zivilen Ungehorsam einen radikalen Wandel herbeiführen möchte um die Risiken des ökologischen Kollaps und des Aussterbens der Menschheit zu minimieren. Wir bringen die Gefahr des Klimakollaps auf die Agenda, informieren die Öffentlichkeit, und üben Druck auf die Regierungen aus, den Klimanotstand auszurufen, und entsprechend angemessen zu handeln.", "timestamp": 619725600, "day": "1"}, {"date": "2019-08-21T20:00:00+02:00", "start": "20:00", "duration": "00:45", "room": "Meitner", "title": "On bendy inflatables and travelling techno", "language": "en", "abstract": "I’ve made several interactive hackercamp installations over the years. I’ll talk about how they work, how they were made (generally very cheaply), about how people found ways to interact with them, and about what I’ve learned about experience design from them. And about where you can find the source code, obviously.", "timestamp": 619725600, "day": "1"}, {"date": "2019-08-21T21:00:00+02:00", "start": "21:00", "duration": "00:45", "room": "Curie", "title": "The Limits of General Purpose SDR devices", "language": "en", "abstract": "It's tempting to buy a SDR device like a LimeSDR or USRP family member in the expectation of operating any wireless communications system out there from pure software.  In reality, however, the SDR board is really only one building block.  Know the limitations and constraints of your SDR board and what you need around it to build a proper transceiver.", "timestamp": 619729200, "day": "1"}, {"date": "2019-08-21T21:00:00+02:00", "start": "21:00", "duration": "00:45", "room": "Meitner", "title": "Math Protected Social Interactions", "language": "en", "abstract": "We have learned that Math might be our last defence line against\r\na real existing all-encompassing surveillance. One central challenge\r\nin this conflict is to combine authentication and anonymity.\r\nNumber theory provides us many tools to create really surprising\r\ntechnologies for social communication. A lot of these technologies\r\nhave not yet been brought to the world of concrete implementations.\r\nThis has the implication that some ideas which have been presented\r\nyears ago are not covered by patents any more.\r\n", "timestamp": 619729200, "day": "1"}, {"date": "2019-08-21T22:00:00+02:00", "start": "22:00", "duration": "01:30", "room": "Curie", "title": "20 Jahre Camp", "language": "de", "abstract": "Aus der Gruppe, die 1999 das erste Camp organisiert hat, reden Tim, Andre und Markus über die Verschmelzung von Open-Air- und Hacker-kultur.", "timestamp": 619732800, "day": "1"}, {"date": "2019-08-21T22:00:00+02:00", "start": "22:00", "duration": "00:45", "room": "Meitner", "title": "Privacy leaks in smart devices: Extracting data from used smart home devices", "language": "en", "abstract": "Remember the good old fun sport, where people bought random hard drives from ebay and did forensics on them?\r\nDid you know you can do the same thing with used IoT devices too? Most end-users have no idea what kind of information their devices are storing and how to securely clean their devices (if that even is possible). Lets explore together what the risks are and how we can extract that data.", "timestamp": 619732800, "day": "1"}, {"date": "2019-08-22T11:00:00+02:00", "start": "11:00", "duration": "00:45", "room": "Meitner", "title": "Hambacher Forst #hambibleibt ", "language": "de", "abstract": "Seit 2012 ist der Hambacher Wald besetzt. ", "timestamp": 619779600, "day": "2"}, {"date": "2019-08-22T12:00:00+02:00", "start": "12:00", "duration": "00:45", "room": "Curie", "title": "OpenCodes", "language": "de", "abstract": "Computer können Kunst erzeugen. Museen können Kunst ausstellten. Wie kann das zusammen kommen? Und welche Rolle spielen Community- und OpenSource-Gedanken darin? Der Vortrag ist die Geschichte eines Ausstellungs- und Bildungskonzeptes, welches auch von Hackern entworfen wurde.", "timestamp": 619783200, "day": "2"}, {"date": "2019-08-22T12:00:00+02:00", "start": "12:00", "duration": "03:00", "room": "Meitner", "title": "Lightning Talks", "language": "en", "abstract": "", "timestamp": 619783200, "day": "2"}, {"date": "2019-08-22T13:00:00+02:00", "start": "13:00", "duration": "00:45", "room": "Curie", "title": "Beyond the Pile of Knobs", "language": "en", "abstract": "This case study of NoScript’s UX redesign showcases tried and true design principles that make security tools usable to a wider range of audiences. \r\n", "timestamp": 619786800, "day": "2"}, {"date": "2019-08-22T14:00:00+02:00", "start": "14:00", "duration": "00:45", "room": "Curie", "title": "Automated security testing for Software Developers who dont know security!", "language": "en", "abstract": "i'll show how the average developer (like me) can secure their software and systems by automatically checking for known vulnerabilities and security issues as part of their CI-Toolchain.\r\nThe Talk will introduce basic security knowhow, then show how you can use Open Source Frameworks to check for vulnerable dependencies, containers and (web-)APIs in a live demo", "timestamp": 619790400, "day": "2"}, {"date": "2019-08-22T16:00:00+02:00", "start": "16:00", "duration": "00:45", "room": "Curie", "title": " Fully Open, Fully Sovereign mobile devices", "language": "en", "abstract": "Removing the barriers to making network independent mobile communications.", "timestamp": 619797600, "day": "2"}, {"date": "2019-08-22T16:00:00+02:00", "start": "16:00", "duration": "00:45", "room": "Meitner", "title": "TAPS Transport Services API", "language": "en", "abstract": "In the last year, a group of researchers and some industry people at the IETF decided to join forces and design a replacement of the BSD Socket API. This talk gives an overview about why the BSD Socket API is considered harmful for the Internet's future and how TAPS tries to solve this problem. Besides the facts, also gives some hints about how standardisation at the IETF works and why all this takes so long…", "timestamp": 619797600, "day": "2"}, {"date": "2019-08-22T17:00:00+02:00", "start": "17:00", "duration": "00:45", "room": "Curie", "title": "A mobile phone that respects your freedom", "language": "en", "abstract": "Motivation and challenges building a mobile phone that respects your freedom, privacy and digital rights - and is hackable. This talk will present a summary of a two year journey, which is still ongoing.", "timestamp": 619801200, "day": "2"}, {"date": "2019-08-22T17:00:00+02:00", "start": "17:00", "duration": "00:45", "room": "Meitner", "title": "River Crab, Harmony and Euphemism", "language": "en", "abstract": "An informative and lighthearted overview of contemporary Chinese online culture ", "timestamp": 619801200, "day": "2"}, {"date": "2019-08-22T18:00:00+02:00", "start": "18:00", "duration": "00:45", "room": "Curie", "title": "Fangespielen mit IMSI-Catchern", "language": "de", "abstract": "Mobiltelefone hinterlassen aufgrund ihrer Funkaktivität in der Umgebung vielfältige Spuren, die von entsprechendem passiven Equipment aufgespürt und verarbeitet werden kann. Doch um tiefer in die Kommunikation zu schauen, braucht es aktive Netzwerkomponenten – sogenannte IMSI-Catcher oder Stingrays, die den Kontakt zu ihren Zielen direkt suchen und Informationen austauschen.\r\n\r\nDoch wenn sich solche hinterhältigen Basisstationen auf die Lauer legen, müssen sie sich zu Erkennen geben – und können erkannt werden. Der Vortrag erörtert technische Hintergründe, verräterische Anzeichen eines Angriffs und was Netzwerkbetreiber und Nutzer dagegen tun können.\r\n\r\nOshie arbeitet seit 4 Jahren an Heuristiken zur Erkennung und Werkzeugen zur Visualisierung von rogue base stations.", "timestamp": 619804800, "day": "2"}, {"date": "2019-08-22T18:00:00+02:00", "start": "18:00", "duration": "00:45", "room": "Meitner", "title": "Robotron - a tech opera", "language": "de", "abstract": "In den letzten 2 Jahren habe ich mich in meiner künstlerischen Arbeit mit der Computerherstellung in der DDR beschäftigt. Technikproduktion in der DDR war durch Planwirtschaft und dem COCOM-Hochtechnologieembargo besonderen Bedingungen unterworfen. Entlang der künstlerischen Ausseinandersetzung möchte ich in dem Vortrag ein Bild über Ostdeutsche Computertechnologie nachzeichnen.", "timestamp": 619804800, "day": "2"}, {"date": "2019-08-22T20:00:00+02:00", "start": "20:00", "duration": "00:45", "room": "Curie", "title": "Die 5G-Überwachungsstandards  ", "language": "de", "abstract": "Europol und die nationalen Polizeibehörden laufen Sturm gegen die neuen Überwachungsstandards, die im „European Telecom Standards Institute“ (ETSI) gerade für die 5G-Netze entwickelt werden. Die Telekom-Industrie hatte die Strafverfolger im ETSI überstimmt. Es sei \"jetzt wichtig, politischen Druck“ auszuüben, \"um die Definition des Standards noch zu beeinflussen“, heißt es in einem internen Schreiben von Anti-Terror-Koordinator Gilles de Kerchove an den EU-Ministerrat. Konkret will man die Terlekoms zwingen, ihre 5G-Netzarchitektur entlang der Bedürfnisse der Strafverfolger auf- und Sicherheitslücken für IMSI-Catcher einzubauen. Der Vortrag schildert den letzten Stand dieser Auseinandersetzung. ", "timestamp": 619812000, "day": "2"}, {"date": "2019-08-22T20:00:00+02:00", "start": "20:00", "duration": "00:45", "room": "Meitner", "title": "500.000 Recalled Pacemakers, 2 Billion $ Stock Value Loss", "language": "en", "abstract": "During an independent security assessment of several pacemaker vendors multiple lethal and highly critical vulnerabilities were found. Based on previous experience with one specific vendor a new way of monetising vulnerabilities has been chosen. After going public a huge discussion on vulnerability disclosure ethics and responsibilities began. The stock value of the affected vendor dropped by 2 billion dollar just in one single day. The security researchers got discredited and a huge lawsuit was started. After a year of mutual accusations and denial more than 500.000 pacemakers got recalled. This talk will provide insights into pacemaker security and share first-hand experience gathered during this project. A special focus will also be on ethical vulnerability disclosure and lessons learned for future security research.", "timestamp": 619812000, "day": "2"}, {"date": "2019-08-22T21:00:00+02:00", "start": "21:00", "duration": "00:45", "room": "Curie", "title": "Caught in the Net", "language": "en", "abstract": "Increasingly, governments are moving to impose regulatory measures that would require the removal of extremist speech or privatize enforcement of existing laws. But all too often, these regulations infringe on human rights. What should societies be doing to counter extremism while ensuring the rights of the vulnerable are preserved?", "timestamp": 619815600, "day": "2"}, {"date": "2019-08-22T21:00:00+02:00", "start": "21:00", "duration": "00:45", "room": "Meitner", "title": "Anykernels meet fuzzing", "language": "en", "abstract": "Battle of making the NetBSD better software by leveraging anykernels", "timestamp": 619815600, "day": "2"}, {"date": "2019-08-22T22:00:00+02:00", "start": "22:00", "duration": "00:45", "room": "Meitner", "title": "Tales from Hardware Security Research", "language": "en", "abstract": "Almost every microcontroller features firmware readout protection. It aims at securing the code, algorithms, and cryptographic keys against unauthorized access. Despite datasheets are promising strong security, our research shows that this is often far from being true. In this talk we want to shed light onto the \"why?\" and especially \"how?\" we approach the security testing of such protection mechanisms. Furthermore, we will talk about our attempts, discussions, and hassles from the vulnerability disclosure process - from successful ones to dead ends.", "timestamp": 619819200, "day": "2"}, {"date": "2019-08-22T23:00:00+02:00", "start": "23:00", "duration": "01:30", "room": "Meitner", "title": "Achtung, Datenpannen!", "language": "de", "abstract": "<p>Eine Mischung aus einem Vortrag und einer Spiel- und Lernshow rund um die Datenschutz-Grundverordnung, die spielerisch Wissenswertes rund um Datenschutz und die Datenschutz-Grundverordnung vermittelt – anhand von tatsächlichen Beratungsanfragen und Datenpannen-Meldungen, die tagtäglich bei den Aufsichtsbehörden eingehen. Im Stil der Spielshow „Der Große Preis“ stehen Kandidaten Rede und Antwort zu skurrilen Fällen und heiß diskutierten Problemen rund um Datenschutz, technischen Maßnahmen und die DS-GVO.</p>\r\n", "timestamp": 619822800, "day": "2"}, {"date": "2019-08-23T12:00:00+02:00", "start": "12:00", "duration": "00:45", "room": "Curie", "title": "Nachhaltige Blockchains", "language": "de", "abstract": "Erfolg der kryptographischen Währung Bitcoin, zu einer der\r\n  meistdiskutierten \"neuen\" Technologien entwickelt. Der sehr schnelle\r\n  Aufstieg von Bitcoin hat viele Problemstellungen zum verteilten\r\n  Vertrauensmanagement, dem Energieverbrauch und dem Schutz der\r\n  Privatsphäre von interessanten Forschungsfragen zu wichtigen\r\n  Herausforderungen für eine nachhaltige wirtschaftliche und\r\n  gesellschaftliche Entwicklung werden lassen. Wir diskutieren, wie wir\r\n  mit recht überschaubaren mathematischen Verbesserungen für weniger\r\n  umweltschädliche, weniger sich zentralisierende und\r\n  datenschutzfreundliche Systeme sorgen können. ", "timestamp": 619869600, "day": "3"}, {"date": "2019-08-23T12:00:00+02:00", "start": "12:00", "duration": "00:45", "room": "Meitner", "title": "#Fusionbleibt", "language": "de", "abstract": "Polizeiwache mitten auf dem Festival? Wasserwerfer? Räumpanzer? WTF?? dachte sich da auch das Fusion Festival. Der Kampf gegen die absurden Pläne von Polizeipräsident Nils Hoffmann-Ritterbusch konnte zum Glück gewonnen werden. Und ist ein Lehrstück dafür, dass zivilgesellschaftlicher Druck eben doch Berge versetzen kann. Wir lassen Drohungen, Protest und Absurditäten aus diesem Lehrstücks gemeinsam Revue passieren. Und ja: es darf gelacht werden.", "timestamp": 619869600, "day": "3"}, {"date": "2019-08-23T13:00:00+02:00", "start": "13:00", "duration": "00:45", "room": "Curie", "title": "Zombie Apocalypse vs. International Health Regulations", "language": "en", "abstract": "The little known International Health Regulations are Earth's last defence line against world-wide health risks. I discuss how they would perform during a Zombie Apocalypse.", "timestamp": 619873200, "day": "3"}, {"date": "2019-08-23T13:00:00+02:00", "start": "13:00", "duration": "00:45", "room": "Meitner", "title": "Domain computers have accounts, too!", "language": "en", "abstract": "In Microsoft Active Directory, computers also have their accounts. We used to consider them useless when they turned up during pentests, but recent research showed that successfully relaying a machine account can actually lead to completely owning the machine. This talk will explain the foundation of such attacks and end with a demonstration of how a non-privileged domain user can get SYSTEM privileges on remote machines.", "timestamp": 619873200, "day": "3"}, {"date": "2019-08-23T14:00:00+02:00", "start": "14:00", "duration": "00:45", "room": "Curie", "title": "Updates from the Onion", "language": "en", "abstract": "The Tor Project is building usable free software to fight surveillance and censorship across the globe. In this talk we'll give an update on what we have been up to in the past months, what happened in the wider Tor ecosystem, and what lies ahead of us.", "timestamp": 619876800, "day": "3"}, {"date": "2019-08-23T14:00:00+02:00", "start": "14:00", "duration": "00:45", "room": "Meitner", "title": "Exposing Systems of Power and Injustice", "language": "en", "abstract": "Presenting the Disruption Network Lab programme in Berlin, we will connect the debate on surveillance and whistleblowing to a cultural framework, analysing the influence of whistleblowing in empowering both experts and non-experts. A talk with Tatiana T_Bazz Bazzichelli and Lieke Ploeger / Disruption Network Lab.", "timestamp": 619876800, "day": "3"}, {"date": "2019-08-23T16:00:00+02:00", "start": "16:00", "duration": "00:45", "room": "Curie", "title": "Neue europäische Überwachungslandschaft", "language": "de", "abstract": "Mit neuen Verordnungen und Richtlinien wachsen in der Europäischen Union weitere Datentöpfe heran. Internetanbieter sollen außerdem Inhalte entfernen und Telekommunikationsdaten auf Verlangen herausgeben. Auch der Kreis der Zugriffsberechtigten wird deutlich erweitert. Ganz legal könnten sogar US-Behörden bald in Europa Abhören dürfen.", "timestamp": 619884000, "day": "3"}, {"date": "2019-08-23T16:00:00+02:00", "start": "16:00", "duration": "00:45", "room": "Meitner", "title": "IT-Sicherheit in vernetzten Gebäuden", "language": "de", "abstract": "Ein automatisiertes Gebäude ist schön, komfortabel und praktisch. Doch das wäre nicht Thema für einen Vortrag beim CCCamp, wenn es nicht einige gravierende Schwachstellen in den Bussystemen gäbe. Der Vortrag bietet eine Einführung in die Funktionalität von vernetzten Gebäuden am Beispiel des KNX Standards. Ohne dass ihr großes Vorwissen benötigt, berichte ich euch von Sicherheitsproblemen und möglichen Lösungsansätzen zur nachträglichen Steigerung der Sicherheit solcher Gebäudeautomatisierungssysteme.", "timestamp": 619884000, "day": "3"}, {"date": "2019-08-23T17:00:00+02:00", "start": "17:00", "duration": "00:45", "room": "Curie", "title": "Mit dem Getränkeautomaten in die Cloud", "language": "de", "abstract": "Ob an Getränkeautomaten oder in der Kantine: Oft wird in Universitäten oder großen Firmen mit einem internen Ausweis bezahlt.\r\nWir haben eines dieser internen Bezahlsysteme einmal genauer in Bezug auf seine IT-Sicherheit untersucht und dabei überraschend viele Schwachstellen festgestellt.", "timestamp": 619887600, "day": "3"}, {"date": "2019-08-23T17:00:00+02:00", "start": "17:00", "duration": "00:45", "room": "Meitner", "title": "Mapping Doomsday", "language": "en", "abstract": "The world is entering a new era of instability. The climate crisis will put great pressure on the (relatively) peaceful balance of world politics. But the field of open source intelligence (OSINT) provides us with a new and unique way to map, study and predict these flashpoints. This talk will look at several technical approaches for using these techniques and include several example studies.", "timestamp": 619887600, "day": "3"}, {"date": "2019-08-23T18:00:00+02:00", "start": "18:00", "duration": "00:45", "room": "Curie", "title": "MegaPixels: Face Recognition Training Datasets", "language": "en", "abstract": "This talk will present the MegaPixels project, a website and resource for exploring face recognition training datasets. MegaPixels is an art and research project about the growing crisis of authoritarian biometric surveillance technologies and how data, often originating from social media, has unwittingly contributed to its growth.", "timestamp": 619891200, "day": "3"}, {"date": "2019-08-23T18:00:00+02:00", "start": "18:00", "duration": "00:45", "room": "Meitner", "title": "50 Jahre Journalismus im Netz", "language": "de", "abstract": "Detlef Borchers und Erich Moechel erzählen, was sie im digitalen Neolithikum gesehen und erlebt, aber nie geschrieben haben. Episoden aus der Frühzeit über Gier & Dummheit & Illusionen bis die Dot.com-Blase brannte & die Datengeilheit in die digitale Welt kam. Geschichten aus den \"Crypto Wars\" samt schrägen Begegnungen mit Schattenmenschen, wie schnell man in was hineingeschlittert wurde & was dabei kaputtging. Wie das Netz halt wurde, was es heute ist.\r\n", "timestamp": 619891200, "day": "3"}, {"date": "2019-08-23T20:00:00+02:00", "start": "20:00", "duration": "00:45", "room": "Curie", "title": "Taking Bluetooth lockpicking to the next level", "language": "en", "abstract": "If hacking chinese padlocks and bike sharing systems isn't enough any more, let's go and open some new doors. Like the ones of some 37th floor Hotel Suites...", "timestamp": 619898400, "day": "3"}, {"date": "2019-08-23T20:00:00+02:00", "start": "20:00", "duration": "00:45", "room": "Meitner", "title": "Was tun gegen Digitale Gewalt gegen Frauen", "language": "de", "abstract": "Digitale Gewalt ist mehr als Hatespeech: Dazu gehören Doxing, Identitätsdiebstahl, Bildmanipulationen und deren Veröffentlichung, Spy Apps und noch mehr. Das meiste davon ist verboten, gilt aber nicht als 'Cybercrime'. Der Talk beschreibt, was dazu gehört, wer betroffen ist, was sich bei dem Thema seit den Doxing-Fällen im Januar getan hat und was nötig wäre, um langfristig etwas zu ändern. ", "timestamp": 619898400, "day": "3"}, {"date": "2019-08-23T21:00:00+02:00", "start": "21:00", "duration": "00:45", "room": "Curie", "title": "Introduction to Mix Networks and Katzenpost", "language": "en", "abstract": "This talk will introduce the fundamental concepts of mix networks as\r\nwell as the Katzenpost mix network free software project. We are not\r\njust implementing a new mix network but starting a new anonymity\r\nmovement and we welcome others to join us! Like Tor, mix networks\r\nprotect metadata by using layered encryption and routing packets\r\nbetween a series of independent nodes. Mix networks resist vastly more\r\npowerful adversary models than Tor though, including partial defense\r\nagainst global passive adversaries. In so doing, mix networks add both\r\nlatency and cover traffic. I shall outline the basic components of a\r\nmix network, touch on their roles in resisting active and passive\r\nattacks. In particular I'll mention how mix networks can be used with\r\nencrypted messaging applications and crypto currency to resist global\r\nnetwork surveillance and traffic analysis.\r\n", "timestamp": 619902000, "day": "3"}, {"date": "2019-08-23T21:00:00+02:00", "start": "21:00", "duration": "00:45", "room": "Meitner", "title": "Introduction to OpenGLES and GLSL programming", "language": "en", "abstract": "This foundation talk describes the basic concepts of the OpenGLES 2.0 real-time rasterizer. We will explain the different stages of the rendering pipeline, briefly introduce the mathematics involved, show the boilerplate code required to setup an OpenGLES program, and finally look at the real fun stuff, which is the GLSL language used in vertex and fragment shaders.\r\n", "timestamp": 619902000, "day": "3"}, {"date": "2019-08-23T22:00:00+02:00", "start": "22:00", "duration": "00:45", "room": "Curie", "title": "#Defensive statt #Offensive am Beispiel von KRITIS", "language": "de", "abstract": "Es wird in einer aktuellen Übersicht aufgezeigt, dass die Cybersicherheitsstrategie in Deutschland keine Strategie darstellt. Darüber Hinaus wird aufgezeigt, welche Gesetzesvorhaben die Sicherheit schwächen oder bereits geschwächt haben und was das für Auswirkungen auf kritische Infrastrukturen (KRITIS) - und somit auf uns als Gesamtbevölkerung - haben kann. Zuletzt werden mögliche Optionen als Forderungen aufgezeigt, durch die sich das aktuelle Lagebild bessern kann.", "timestamp": 619905600, "day": "3"}, {"date": "2019-08-23T22:00:00+02:00", "start": "22:00", "duration": "00:45", "room": "Meitner", "title": "What you see is not what you get - when homographs attack", "language": "en", "abstract": "This talk offers a brief overview about homograph attacks, describes part of the mechanics behind the registration of homograph domains, highlights their risks and presents a chain of two practical exploits against Signal, Telegram and Tor Browser that could lead to nearly impossible to detect phishing scenarios and also situations where more powerful exploits could be used against an opsec-aware target.", "timestamp": 619905600, "day": "3"}, {"date": "2019-08-23T23:00:00+02:00", "start": "23:00", "duration": "00:45", "room": "Meitner", "title": "Participatory art event tools, co-creation and silk road networks", "language": "en", "abstract": "The Borderland is a participatory art event in Denmark with 3210 co-creators. Over the last three years, we have created online tools to keep participation and co-creation high as the event has tripled in size in only three years. This seminar is about the design philosophy behind these tools, drawing parallels to the ancient silk road. These tools have since been spread to at least five other events around the world.", "timestamp": 619909200, "day": "3"}, {"date": "2019-08-24T12:00:00+02:00", "start": "12:00", "duration": "00:45", "room": "Curie", "title": "LO! An LLVM Obfuscator", "language": "en", "abstract": "In this talk we will present how intermediate code transformations can be used to obfuscate code and the advantadges and limitations they introduce. We will also brielfy discuss some techniques that could help detect and reverse code obfuscated in such ways.", "timestamp": 619956000, "day": "4"}, {"date": "2019-08-24T12:00:00+02:00", "start": "12:00", "duration": "00:45", "room": "Meitner", "title": "Solare Brennstoffe - Wasserstoff aus Sonnenlicht", "language": "de", "abstract": "Sonnenenergie deckt heute erst etwas über 2% des weltweiten Energiebedarfs durch Umwandlung von Sonnenlicht in elektrische Energie. Eine der Möglichkeiten, um diese zu speichern, ist die Elektrolyse von Wasser, um Wasserstoff zu erhalten.\r\nWas aber wäre, wenn man Wasserstoff direkt gewinnen könnte?\r\n\r\nEine schnelle Übersicht über Sonnenlicht, das Prinzip hinter Photovoltaischen Solarzeiien, und wie photoelektrochemische Zellen, die flüssiges Wasser in seine Bestandteile Wasserstoff und Sauerstoff spalten können, beide Prozesse miteinander kombinieren können.", "timestamp": 619956000, "day": "4"}, {"date": "2019-08-24T13:00:00+02:00", "start": "13:00", "duration": "00:45", "room": "Curie", "title": "Technopolice: calling out so-called \"Safe Cities\"", "language": "en", "abstract": "In many French cities (and beyond), mayors are pushing towards \"safe Smart Cities\", pushing for technology everywhere. Microphones, video-surveillance, automated drones, facial recognition, machine learning is the recipe of their fantasised secure city.\r\n\r\nThis talk will introduce Technopolice, the new campaign from La Quadrature du Net, its goals, its tools, and the way we will make it happen.", "timestamp": 619959600, "day": "4"}, {"date": "2019-08-24T13:00:00+02:00", "start": "13:00", "duration": "00:45", "room": "Meitner", "title": "Love, CyBorgs, Art and Open Source- an artistic approach on how to stay golden", "language": "en", "abstract": "Here we are, a new generation. Actually not only that, we are moving forward in evolution. The Antropocene is screaming for action, but -  „Yeah right, I know... we‘re working on it!“ she told me. Does Sophia really know? Do I care? 42?", "timestamp": 619959600, "day": "4"}, {"date": "2019-08-24T14:00:00+02:00", "start": "14:00", "duration": "00:45", "room": "Curie", "title": "Ethikrichtlinien für Künstliche Intelligenz? Wie wär's mit Gesetzen?", "language": "de", "abstract": "Bisweilen kann man sich des Eindrucks nicht erwehren, jede zweite Woche würde eine neue, wachsweiche Selbstverpflichtung für den ethischen Einsatz von Algorithmen bekanntgegeben. Privatwirtschaftliche wie öffentliche Organisationen übertrumpfen sich geradezu dabei zu betonen, dass der Mensch bei allen maschinellen Entscheidungen im Mittelpunkt stehen soll und dass diese transparent sein müssen. Aber was bringt einem das Wissen um benachteiligende oder falsche Funktionsweise der Algorithmen, wenn man sie dennoch nicht verbieten kann? Und: sollten wir die Regeln für den zukünftigen Einsatz von Maschinen wirklich von den Konzernen gestalten lassen, die diese Technologien entwickeln? \r\n\r\nWir zeigen, wie wenig konkret die verschiedenen Selbstverpflichtungen der Unternehmen, Verbände und Organisationen sind und wie all das Reden über Ethik  in den meisten Fällen einem Ziel dient: gesetzliche Regulierung verhindern.", "timestamp": 619963200, "day": "4"}, {"date": "2019-08-24T14:00:00+02:00", "start": "14:00", "duration": "00:45", "room": "Meitner", "title": "Cyborg Foundation ", "language": "en", "abstract": "Presentation of the Cyborg Foundation, its philosophy, members and developed projects. Based in Barcelona and founded in 2017, CFL is an association that gives voice to non-human identities.  ", "timestamp": 619963200, "day": "4"}, {"date": "2019-08-24T16:00:00+02:00", "start": "16:00", "duration": "00:45", "room": "Curie", "title": "Privacy: An Unequally Distributed Resource", "language": "en", "abstract": "In this talk, we'll investigate how privacy has become an indicator of privilege in our world. Does everyone have equal access to privacy? How does unequal privacy affect the lives of people? Should we treat privacy like other privileges (i.e. wealth, race, gender)? If we have access to privacy, is this something we can share? By the end of the talk, we'll have explored how the concept of privacy has changed, what we can do about these changes and some practical steps for making privacy more accessible for those who most need it.\r\n", "timestamp": 619970400, "day": "4"}, {"date": "2019-08-24T16:00:00+02:00", "start": "16:00", "duration": "00:45", "room": "Meitner", "title": "Was ihr schon immer (nicht) über Koffein wissen wolltet", "language": "de", "abstract": "Koffein als Substanz wird Tag für Tag aufgrund seiner anregenden Wirkung von vielen Menschen konsumiert, doch was genau steckt eigentlich hinter dieser Substanz? In diesem Talk blicken wir in die Chemie, Herkunft, Wirkung, Gefahren und weitere Aspekte des Koffeins.", "timestamp": 619970400, "day": "4"}, {"date": "2019-08-24T17:00:00+02:00", "start": "17:00", "duration": "00:45", "room": "Curie", "title": "From DC to RF...starting where?", "language": "en", "abstract": "This talk will focus on learning and re-learning RF topics, from the perspective of a  semi-experienced engineer. We will review rules of thumb, practical experience and the theory of RF and how it all fits together for your next PCB design. This will also be contrasted with best-practices for designing lower frequency circuits and how it all fits together. ", "timestamp": 619974000, "day": "4"}, {"date": "2019-08-24T17:00:00+02:00", "start": "17:00", "duration": "00:45", "room": "Meitner", "title": "Wisdom of OS", "language": "de", "abstract": "Klimakrise, Artensterben, die Grundlagen des Leben – unsere Herausforderungen sind dringend, global und komplex. Seit dem Anthropozän wissen wir, dass der Planet in unserer Hand liegt. Jetzt müssen wir unsere Köpfe zusammenstecken und gemeinsam Lösungen entwickeln. Anknüpfend an historischen Konzepte von einer das Weltwissen allgemein zugänglich machenden World Encyclopedia und des künstlich intelligenten Word Brain kann eine interdisziplinäre Betrachtung durch unterschiedliche Herangehensweisen spannende neue Sichtweisen eröffnen.\r\n\r\nDie Wahrnehmung von Betriebssystemen als Schnittstelle zwischen Mensch und Maschine, die Auswirkung von Softwarelizenzen auf die Gestaltung der Verhältnisse zwischen Maschinen, Menschen, Firmen und Staaten und die mit einer weltweiten Vernetzung entstehenden Chancen und Risiken können aus Hackersicht von einem sehr technischen Startpunkt analysiert werden.\r\n\r\nDas Anthropzän verlangt den Übergang in die Noosphäre. Und das heißt, wir müssen das  Urheberrecht als juristisches Betriebssystem unserer Wissensordnung in Ordnung bringen, das Netz als seine technische Infrastruktur redezentralisieren und semantifizieren, unser wissenschaftliches, journalistisches und künstlerisches Sensorium stärken und Werkzeuge entwickeln, die es uns erlauben, gemeinsam zu denken und zu enstscheiden. Mehr als künstliche brauchen wir menschliche kollektive Intelligenz, um die Betriebssysteme unserer Gesellschaft mit kollektiver Weisheit auszustatten.", "timestamp": 619974000, "day": "4"}, {"date": "2019-08-24T18:00:00+02:00", "start": "18:00", "duration": "00:45", "room": "Curie", "title": "Fast Global Internet Scanning - Challenges and new Approaches", "language": "en", "abstract": "Current search engines such as censys or shodan give everyone an insight into the global Internet. Unfortunately, they don't provide a comprehensive view of the Internet because you can't access the raw data. Consequently, you have to scan the Internet yourself.\r\nAnyone can perform a one-shot scan via Mass-Scan & Co. However, how to build an infrastructure for regular Internet scans that is not blocked after a short time by Intrussion Detection Systems and Spam/Blacklists is not easy. \r\nFirst we will talk about the right scan setup, infrastructure, scan strategies, and data enrichment. We will then take a look at the data and gain common and interesting insights into the structure of the Internet.", "timestamp": 619977600, "day": "4"}, {"date": "2019-08-24T18:00:00+02:00", "start": "18:00", "duration": "00:45", "room": "Meitner", "title": "Power-to-X", "language": "en", "abstract": "This talk will give an introduction into the general concepts of power-to-x and then go more into detail on carbon capture and utilization (CCU). CCU is the idea of building up a closed carbon cycle, where CO2 is recycled, towards fuels and base chemicals, under the use of renewable energy. The talk will give insight in the technology, chemistry, possibilities and challenges. ", "timestamp": 619977600, "day": "4"}, {"date": "2019-08-24T20:00:00+02:00", "start": "20:00", "duration": "00:45", "room": "Curie", "title": "Deaths per TWh", "language": "en", "abstract": "Climate change and the discussion about reducing CO2 emissions to ensure matching the Paris agreement currently is the most important topic in our political and economic discussions. We all agree reducing emissions is a necessity, but how can we possibly achieve this in a world that consumes more energy than ever before? And which price are we willing to pay for it?", "timestamp": 619984800, "day": "4"}, {"date": "2019-08-24T20:00:00+02:00", "start": "20:00", "duration": "00:45", "room": "Meitner", "title": "schleuderpackung 2.0", "language": "de", "abstract": "Technischer Überblick zum Build-Prozess der Datenschleuder. Vom LaTeX-Backend (schleuderpackung) über Continous Integration (Zentrifuge) zum PDF, Epub und HTML-Auszügen.", "timestamp": 619984800, "day": "4"}, {"date": "2019-08-24T21:00:00+02:00", "start": "21:00", "duration": "00:45", "room": "Curie", "title": "Little Big Data", "language": "de", "abstract": "Ein Geheimdienst im 21. Jahrhundert, der was auf sich hält, muss Big Data machen: Möglichst alles über alle Bürger sammeln, horten, sortieren, filtern, rastern und ja niemandem was von den Ergebnissen mitteilen. Da haben wir uns gedacht: Das können wir auch! Daher machen wir für unseren eigenen Kurznachrichtendienst eben in Little Big Data.", "timestamp": 619988400, "day": "4"}, {"date": "2019-08-24T21:00:00+02:00", "start": "21:00", "duration": "00:45", "room": "Meitner", "title": "From the Sputnik 'Beep' to messages from Pluto", "language": "en", "abstract": "To tinker with receivers for space-signals, its good to know the different space communication standards. And to understand space standards, it doesn't hurt to get an overview of how to transmit data in the first place.", "timestamp": 619988400, "day": "4"}, {"date": "2019-08-24T22:00:00+02:00", "start": "22:00", "duration": "00:45", "room": "Curie", "title": "Architecture of secure IoT devices", "language": "en", "abstract": "This talk will present a secure IoT architecture by design, incorporating secure boot (such as HAB of iMx6), secure update processes, system partitioning and redundancy, system recovery, flash wear-out, and secure remote access, ", "timestamp": 619992000, "day": "4"}, {"date": "2019-08-24T22:00:00+02:00", "start": "22:00", "duration": "00:45", "room": "Meitner", "title": "Physical Unclonable Functions: The Future Technology for Physical Security Enclosures?", "language": "en", "abstract": "In this talk, I will give an overview of the past, present, and possible future of physical security enclosures, i.e., the physical boundary that protects Hardware Security Modules (HSMs) and separates the untrusted outside from the secret data inside the module. I will present an analysis of the hardware security features in some selected HSMs, ranging from sensitive carbon meshes, over light detectors, up to temperature sensors. Since the security of these solutions has recently been questioned and some of them have been discontinued, new technologies have been proposed by several research groups, which will be presented in the second half of my talk. I will give insight into the current research regarding future solutions whose security is based on Physical Unclonable Functions (PUFs). Via this technology, cryptographic keys are extracted from intrinsic manufacturing variation of the enclosure itself. Thus, a violation of the delicate enclosure results in immediate loss of information and thereby voids cryptographic keys - in theory. Finally, I will discuss existing drawbacks and issues which have to be resolved, which currently prevent PUFs from protecting HSMs.", "timestamp": 619992000, "day": "4"}, {"date": "2019-08-25T12:00:00+02:00", "start": "12:00", "duration": "00:45", "room": "Curie", "title": "Fighting back against Libra - Decentralizing Facebook Connect", "language": "en", "abstract": "The power of Facebook derives from its control over your digital identity. However, the fundamental technologies behind anonymous (attribute-based) authentication credentials have existed since the mid-90s. This talk will cover new advances in anonymous authentication credentials, how the work was nearly killed by Facebook, and their real-world implementation, including their use in the Nym project's mix-net, cryptocurrency, and decentralized messaging applications. ", "timestamp": 620042400, "day": "5"}, {"date": "2019-08-25T13:00:00+02:00", "start": "13:00", "duration": "00:45", "room": "Curie", "title": "Why Nobody cares, and only You can save the World", "language": "en", "abstract": "This talk aims to provide a possible explanation why most people seem to care very little about the unethicality of much of today’s technologies. It outlines what science and philosophy tell us about the biological and cultural evolutionary origins of (human) morality and ethics, introduces recent research in moral cognition and the importance of moral intuitions in human decision making, and discusses how these things relate to contemporary issues such as A(G)I, self-driving cars, sex-robots, “surveillance capitalism”, the Snowden revelations and many more. Suggesting an “intuition void effect” leading standard users to remain largely oblivious to the moral dimensions of many technologies, it identifies technologists as “learned moral experts”, and emphasizes their responsibility to assume an active role in safeguarding the ethicality of today’s and future technologies.", "timestamp": 620046000, "day": "5"}, {"date": "2019-08-25T13:00:00+02:00", "start": "13:00", "duration": "00:45", "room": "Meitner", "title": "Making video games in a weekend", "language": "en", "abstract": "Are you curious about making your own video game? Game jams are a brilliant opportunity to try that, and a fun challenge for interdisciplinary teams of all skill levels! They're basically hackathons, but for video games - you're given a certain theme, and are encouraged to make a game around that in two or three days. In this talk, I want to empower and inspire you to try that yourself!\r\n\r\nWhen I first joined in the large, international game jam \"Ludum Dare\" in 2016, I found it a very rewarding experience, that got me in a flow-like state of mind. I liked it so much that I've since participated 10 times in a row - at this point, I have tons of experience, which I want to share with you!", "timestamp": 620046000, "day": "5"}, {"date": "2019-08-25T14:00:00+02:00", "start": "14:00", "duration": "00:45", "room": "Curie", "title": "\"Service Point\" The Display", "language": "en", "abstract": "The walls of CCC Berlin are filled with posters, analog as well as digital art, and also: a large LED display! The display is a proper piece of dual-use technology, serving both as hack material for fun and as a useful tool e.g. for taking notes during meetings.", "timestamp": 620049600, "day": "5"}, {"date": "2019-08-25T14:00:00+02:00", "start": "14:00", "duration": "00:45", "room": "Meitner", "title": "Die Zukunft hat zwei Wellen", "language": "de", "abstract": "Freifunk steht vor dem Abgrund, der Flash ist voll, der RAM ist zu klein, so löt doch einfach neuen ein? Wir betrachten hier die aktuellen Probleme die viele Communities mit ihrer Hardwarebasis erleben und betrachten die Vor- und Nachteile der verschiedenen Wege, diese Probleme zu lösen.", "timestamp": 620049600, "day": "5"}, {"date": "2019-08-25T16:00:00+02:00", "start": "16:00", "duration": "00:45", "room": "Curie", "title": "c3Power Monitoring CCCamp 19", "language": "de", "abstract": "Infastructure Review des Camp 2019 Stromnetz aus Sicht des auf der GPN in der Theorie vorgestellten Low Cost Power Monitoring. Aufbau des Monitoring-Netzes, Inbetriebname und Ergebnisse von Tag -1 bis Tag 4", "timestamp": 620056800, "day": "5"}, {"date": "2019-08-25T16:00:00+02:00", "start": "16:00", "duration": "00:45", "room": "Meitner", "title": "Visualization of networks using physics", "language": "en", "abstract": "The beautifully complex structures often found in Nature arise from the collective interaction of huge numbers of particles moving under very simple forces.\r\nStarting from this fact, I will present how we can encode simple physical properties into large scale networks in a way that mimics a physical system and leads to elegant structures in 2d or 3d space. \r\nAfter introducing some basic concepts, a large part of the talk will consist of animated demonstrations of network evolution towards a final layout. The talk is aimed at scientists and curious non-scientists alike.", "timestamp": 620056800, "day": "5"}, {"date": "2019-08-25T17:00:00+02:00", "start": "17:00", "duration": "00:45", "room": "Curie", "title": "Infrastructure Review", "language": "en", "abstract": "", "timestamp": 620060400, "day": "5"}, {"date": "2019-08-25T18:00:00+02:00", "start": "18:00", "duration": "00:30", "room": "Curie", "title": "Closing ceremony", "language": "en", "abstract": "A farewell.", "timestamp": 620064000, "day": "5"}], "daysCount": 5}